module user

	implicit none

	INTEGER, PARAMETER :: 			&
		DP = SELECTED_REAL_KIND(14),	&

!-----------------------------------------------------------------------------------------------!
!					GRID AND DOMAIN SIZE					!
!-----------------------------------------------------------------------------------------------!
		Nx=51,			&	 ! Nodes in the x-direction
		itermax=20000		 ! Maximum number of iterations
		
		  
	real(KIND = DP)  ::			&

		Hx=1.0D+00,			& ! Domain size [m]
		DX,				&
		Hx1=4.5D-01,			&
		
!-----------------------------------------------------------------------------------------------!
!					NUMERICAL PARAMETERS					!
!-----------------------------------------------------------------------------------------------!

		epsilonT=1.0D-10,		& ! Residual tolerance for T

!-----------------------------------------------------------------------------------------------!
!					THERMOPHYSICAL PROPERTIES				!
!-----------------------------------------------------------------------------------------------!

		Ta=0D+00,			& ! Temperature at A [ºC]
		Tb=100D+00,			& ! Temperature at B [ºC]
		Lambda1=3.9D-02,		& ! Thermal conductivity #1 [W/m.ºC]
		Cp1=1800D+00,			& ! Specific heat #1 [J/kg.ºC]
		Lambda2=35D+00,		& ! Thermal conductivity #2 [W/m.ºC]
		Cp2=130D+00,			& ! Specific heat #2 [J/kg.ºC]
		
		
		Res_T,Rmax_T, &
		Tref, &
		time_start,time_finish

!-----------------------------------------------------------------------------------------------!
!					SOLVER OPTIONS						!
!-----------------------------------------------------------------------------------------------!
	
	integer::				&

		iter,i

!-----------------------------------------------------------------------------------------------!
!					MATRIX DIMENSIONS					!
!-----------------------------------------------------------------------------------------------!
	
	
	
	real(KIND = DP), dimension(Nx) :: 	&
		DXP,X, 	&
		ae,aw,ap,b			
		
	real(KIND = DP), dimension(Nx) :: 	&
		T,Ti			

end module user
